<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest Autodesk Memento DMG and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.usit-mac.autopkg.munki.Memento</string>
    <key>version</key>
    <string>%VERSION%</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Memento</string>
      <key>pkginfo</key>
      <dict>
	<key>name</key>
	<string>%NAME%</string>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>description</key>
        <string>Autodesk Memento is an end-to-end solution for converting any captured reality input (photos or scans) into high definition 3D meshes that can be cleaned up, fixed, and optimized for the Web, mobile or 3D printing  fabbing.</string>
	<key>display_name</key>
        <string>Memento</string>
        <key>unattended_install</key>
        <true/>
        <key>supported_architectures</key>
        <array>
          <string>x86_64</string>
        </array>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.usit-mac.autopkg.download.Memento</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>apps/autodesk</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
