<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Memento disk image.

</string>
    <key>Identifier</key>
    <string>com.github.usit-mac.autopkg.download.Memento</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Memento</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
	    <string>CURLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://memento.autodesk.com/try-memento</string>
              <key>re_pattern</key>
              <!-- http://up.autodesk.com/2016/MEM/Memento_Signed_20151209103640.dmg -->
              <string>(http://up.autodesk.com/[0-9]{4}/MEM/Memento_Signed_[0-9\.]+\.dmg)</string>
              <key>result_output_var_name</key>
              <string>url</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
            <key>filename</key>
            <string>%NAME%.dmg</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/memento.app</string>
            <key>requirement</key>
            <string>anchor apple generic and  identifier "com.autodesk.memento" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
